app/controllers/books_controller.rb

SELECT "books".* FROM "books" ORDER BY "books"."position" ASC
---
  def index
    @books = Book.order(:position)

INSERT INTO "books" ("name", "position", "description", "read", "created_at", "updated_at", "genre_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["name", "Game of Thrones"], ["position", 1], ["description", "Got"], ["read", false], ["created_at", "2023-02-04 03:09:18.583294"], ["updated_at", "2023-02-04 03:09:18.583294"], ["genre_id", nil]]
---
  def create
    @book = Book.new(params.require(:book).permit(:name, :position, :read, :description))
    if @book.save

SELECT "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "description" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["description", "GoY"], ["updated_at", "2023-02-04 03:27:32.093706"], ["id", 3]]
---
  def update
    @book = Book.find(params[:id])
    if @book.update(book_params)